# FirstColumnNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..FirstColumnNumber Property
TableSectionData Class See Also
---
The first column in this section of the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int FirstColumnNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FirstColumnNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int FirstColumnNumber {
	int get ();
}
```

# Remarks
Some table sections have column 0 as their first column while others start with column 1.
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace